## Decision Tree

In this project I've used Decision Tree classification algorithm on Titanic dataset and evaluated accuracy computed by it.

In [2]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import roc_auc_score

In [3]:
df= pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### Dropped unnecessary columns.

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis=1, inplace=True)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   Fare      891 non-null    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 34.9+ KB

#### Converted Sex column into categorical.

In [6]:
dummy_df= pd.get_dummies(df.Sex)
dummy_df.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [7]:
type(dummy_df)

pandas.core.frame.DataFrame

In [8]:
df= pd.concat([df, dummy_df], axis=1)
df.head()

   Survived  Pclass     Sex   Age     Fare  female  male
0         0       3    male  22.0   7.2500       0     1
1         1       1  female  38.0  71.2833       1     0
2         1       3  female  26.0   7.9250       1     0
3         1       1  female  35.0  53.1000       1     0
4         0       3    male  35.0   8.0500       0     1

In [9]:
df.drop(['Sex'], axis=1, inplace= True)
df.head()

   Survived  Pclass   Age     Fare  female  male
0         0       3  22.0   7.2500       0     1
1         1       1  38.0  71.2833       1     0
2         1       3  26.0   7.9250       1     0
3         1       1  35.0  53.1000       1     0
4         0       3  35.0   8.0500       0     1

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Age       714 non-null    float64
 3   Fare      891 non-null    float64
 4   female    891 non-null    uint8
 5   male      891 non-null    uint8
dtypes: float64(2), int64(2), uint8(2)
memory usage: 29.7 KB

In [11]:
df.isnull().sum()

Survived      0
Pclass        0
Age         177
Fare          0
female        0
male          0
dtype: int64

In [12]:
df.Age[df.Age.isnull()]

5     NaN
17    NaN
19    NaN
26    NaN
28    NaN
       ..
859   NaN
863   NaN
868   NaN
878   NaN
888   NaN
Name: Age, Length: 177, dtype: float64

#### Imputation

In [13]:
df.Age= df.Age.fillna(int(df.Age.mean()))

In [14]:
df.Age[888]

29.0

#### Split the df

In [15]:
X= df.drop(['Survived'], axis=1)

In [16]:
y= df.Survived

In [17]:
X_train, X_test, y_train, y_test= train_test_split(X, y, train_size=0.8, random_state=1)

In [18]:
X_train.shape

(712, 5)

In [19]:
X_test.shape

(179, 5)

#### Training the model

In [24]:
clf= DecisionTreeClassifier()
clf.fit(X_train, y_train)
predictions_test= clf.predict(X_test)

In [25]:
test_score= roc_auc_score(y_test, predictions_test)
test_score

0.7468984233652107

In [26]:
predictions_train= clf.predict(X_train)
train_score= roc_auc_score(y_train, predictions_train)
train_score

0.9754378309431302

In [27]:
print(f'Accuracy of train {train_score} and of test {test_score}')

Accuracy of train 0.9754378309431302 and of test 0.7468984233652107

#### Tweaked the parameters

In [31]:
clf_2= DecisionTreeClassifier(max_depth= 5, min_samples_split= 10)

clf_2.fit(X_train, y_train)

predictions= clf_2.predict(X_test)
test_score= roc_auc_score(y_test, predictions)
test_score

0.7905789609718273

In [32]:
predictions= clf_2.predict(X_train)
train_score= roc_auc_score(y_train, predictions)
train_score

0.8314466253241248

In [33]:
print(f'Accuracy of train {train_score} and of test {test_score}')

Accuracy of train 0.8314466253241248 and of test 0.7905789609718273

#### The model fit well.